"""
============================================================
Day 1 练习题：Python 基础语法
============================================================
请完成以下练习，巩固今天学的内容。
每个练习都有提示，先自己写，再看提示！
"""

# ============================================================
# 练习 1：Hello, You!
# 写一段代码，让用户输入自己的名字，然后打印 "你好，XXX！欢迎学习 Python！"
# ============================================================

# TODO: 在这里写你的代码
name  = input("请输入你的名字：")

print(f"你好，{name}! 欢迎学习python!",end="\n")


# ============================================================
# 练习 2：简单计算器
# 让用户输入两个数字，然后输出它们的 和、差、积、商
# 提示：input() 返回的是字符串，需要用 int() 或 float() 转换
# ============================================================

# TODO: 在这里写你的代码
a = input()
b = input()
a = float(a)
b = float(b)
print(f"{a+b}")
print(f"{a-b}")
print(f"{a*b}")
print(f"{a/b}")



# ============================================================
# 练习 3：成绩等级判断
# 输入一个分数（0-100），输出对应的等级：
#   >= 90 → A
#   >= 80 → B
#   >= 70 → C
#   >= 60 → D
#   < 60  → F
# 提示：用 if/elif/else
# ============================================================

# TODO: 在这里写你的代码

grade = input()
grade = int(grade)
if grade >= 90:
    print("A")
elif grade >= 80:
    print("B")
elif grade >= 70:
    print("C")
elif grade >= 60:   
    print("D")
else:
    print("F")


# ============================================================
# 练习 4：打印九九乘法表（前 5 行即可）
# 用 for 循环打印：
#   1x1=1
#   2x1=2  2x2=4
#   3x1=3  3x2=6  3x3=9
#   ...
# 提示：两个嵌套 for 循环 + range(1, ?)
# ============================================================

# TODO: 在这里写你的代码
for i in range(1,6):
    for j  in range(1,i+1):
        print(f"{i}x{j}={i*j}",end=" ")
    print()
    


# ============================================================
# 练习 5：猜数字游戏
# 程序随机生成一个 1-100 的整数，让用户来猜
# 每次猜完提示"大了"或"小了"，直到猜对为止
# 额外：记录用户猜了几次
# 提示：import random → random.randint(1, 100)
# ============================================================

# TODO: 在这里写你的代码
import random
ans = random.randint(1,100)
gus = input("请开始猜随机数")
gus  = int(gus)
count = 1
while(gus != ans):
    if(gus > ans):
        print(f"猜大了")
        count += 1
        gus = int(input())
        
    elif(gus < ans):
        print(f"猜小了")
        count += 1
        gus  = int(input())
        
print(f"猜对了！ 猜次数为{count}")
    


# ============================================================
# 练习 6（选做）：字符串小挑战
# 输入一个英文句子，统计：
#   a) 总共有多少个单词（以空格分割）
#   b) 句子里有没有 "python" 这个词（忽略大小写）
# 提示：.split(), .lower(), in 运算符
# ============================================================

# TODO: 在这里写你的代码
#len(ls) 先对str转小写再分割 列表不能转小写
s = input("输入英语句子")
ls = s.lower().split()
count  = len(ls)
if("python" in ls):
    print(f"存在python")
print(f"句子里有{count}个单词")

print("\n[Congrats!] 全部练习完成！运行 day01_notes.py 中的示例代码加深理解。")
